app/views/album_invs/_form.html.erb

    <% options = options_from_collection_for_select(@artists, 'id', 'name') %>
    <%= form.select :Artist,  options  %>
---
SELECT `artists`.* FROM `artists`

    <% options = options_from_collection_for_select(@pubs, 'id', 'name') %>
    <%= form.select :Publisher,  options %>
---
SELECT `publishers`.* FROM `publishers`