app/controllers/album_invs_controller.rb

SELECT `album_invs`.* FROM `album_invs`
---
  def index
    @album_invs = AlbumInv.all

SELECT `album_pubs`.* FROM `album_pubs`
SELECT `artists`.* FROM `artists`
---
  def new
    @album_inv = AlbumInv.new
    @pubs =AlbumPub.all
    @artists = Artist.all

SELECT `album_pubs`.* FROM `album_pubs`
SELECT `artists`.* FROM `artists`
---
  def edit
    @pubs =AlbumPub.all
    @artists = Artist.all

INSERT INTO `album_invs` (`Title`, `Genre`, `Year`, `dAdded`, `Plays`, `created_at`, `updated_at`, `Publisher`) VALUES ('Achtung Baby', 'Rock', '2018-09-03', '2018-09-10', 2, '2018-09-10 17:16:26', '2018-09-10 17:16:26', '2')
---
  def create
    @album_inv = AlbumInv.new(album_inv_params)
    @pubs =AlbumPub.all
    @artists = Artist.all


    respond_to do |format|
      if @album_inv.save

UPDATE `album_invs` SET `Publisher` = '1', `updated_at` = '2018-07-06 21:16:46' WHERE `album_invs`.`id` = 1
---
  def update
    respond_to do |format|
      if @album_inv.update(album_inv_params)

SELECT  `album_invs`.* FROM `album_invs` WHERE `album_invs`.`id` = 1 LIMIT 1
---
    def set_album_inv
      @album_inv = AlbumInv.find(params[:id])