app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
      @user = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password`, `password_confirmation`) VALUES ('Randy ', 'scubalee@gmail.com', '2018-09-10 20:43:17', '2018-09-10 20:43:17', 'Magboo12', 'Magboo12')
---
 def create
    @user = User.new(user_params)
    if @user.save